"1. Только первые 3 элемента. Начнем с самого начала, и закончим на троечке, ну, то есть :3. Я НЕ ЗНАЮ КАК РАСПИСАТЬ ЭТО НЕ СМАЙЛИК. Ладно насрать поехали"
# nums = [1, 2, 3, 4, 5, 6, 7]
# print(nums[:3])
"ИИИИИИИИИИ тогда по идее мы должны получить следующее = [1, 2, 3]"
"2. Ничего себе задача, все кроме 1? Чем она так провинилась?"
# nums = [10, 20, 30, 40, 50]
# print(nums[1:])
"Ооооооо ну я вас сильно удивлю получится ПРОСТО [20, 30, 40, 50]"
"3. Нет основного понятия для пайтона из серии 'выдели четное и нечетное' но за то в математике есть такое понятие(точнее помогает). Если ходить через цифру то получишь ТОЛЬКО ЧЕТНЫЕ(жаль не по морде) ну или нечетные смотря откуда начнешь"
# nums = [1, 2, 3, 4, 5, 6]
"Омагад мы просто срезаем чиселки о нет чтоооо это законно да ну не верю да ладно ооооооооо"
# print(nums[1::2])
"Я АМЕРИКУ ОТКРЫЛ, ПОЛУЧИТСЯ [2, 4, 6] ЕЩКЕРЕЕЕЕЕЕЕ"
"---------------------"
"4. Четвертое мне лень писать конечно ладно не важно напишу все таки это мне нужно сделать"
# word = "Marselos"
# print(word[:4])
"Я вас удивлю, получится просто Mars"
"5. Хммммммммм. ХММММММММММММММММ. Нууууу, нужно подумать. "
# nums = [1, 2, 3, 4, 5]
# print(nums[::-1])
"Я только щас записываю так словно это пишет какой то конченный ученый ну да ладно. В ответе получится [5, 4, 3, 2, 1]. Сложно да? Да"